sampling/line/0/wallShearStress
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      wallShearStress;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];


internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<vector> 
70
(
(-0.0001562266985555544 0 0)
(-0.0001554726561523734 1.219345473680557e-22 0)
(-0.0001527361339395551 0 0)
(-0.0001480392165559455 -1.161225176898406e-22 0)
(-0.0001425693205386908 0 0)
(-0.0001371514062841769 0 0)
(-0.0001321160005360233 0 0)
(-0.0001275308358961345 0 0)
...
)
;
    }
    bottomWall
    {
        type            calculated;
        value           nonuniform List<vector> 
70
(
(-0.0001562351823229038 -2.782750563363427e-07 -0)
(-0.0001581304982552008 -7.19247656386778e-06 -1.443484316753049e-22)
(-0.0001755209883161247 -2.021038105803968e-05 -6.852646184816394e-22)
(-0.000199351584170392 -2.803591738622836e-05 -1.464006642658043e-21)
(-0.0002079083042836441 -2.996302300374284e-05 -7.402416534595727e-22)
(-0.0002031898184323678 -2.932600548301894e-05 -1.304378604319835e-21)
(-0.0001907739485460072 -2.750814852387524e-05 -0)
(-0.0001795300812975241 -2.582617672531141e-05 -0)
...
)
;
    }
    front
    {
        type            symmetry;
    }
    back
    {
        type            symmetry;
    }
}


// ************************************************************************* //
