sampling/line/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    location        system;
    object          sampleDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Set output format : choice of
//      xmgr
//      jplot
//      gnuplot
//      raw
setFormat raw;

// Surface output format. Choice of
//      null        : suppress output
//      foamFile    : separate points, faces and values file
//      dx          : DX scalar or vector format
//      vtk         : VTK ascii format
//      raw         : x y z value format for use with e.g. gnuplot 'splot'.
//
// Note:
// other formats such as obj, stl, etc can also be written (by proxy)
// but without any values!
surfaceFormat vtk;

// interpolationScheme. choice of
//      cell          : use cell-centre value only; constant over cells (default)
//      cellPoint     : use cell-centre and vertex values
//      cellPointFace : use cell-centre, vertex and face values.
// 1] vertex values determined from neighbouring cell-centre values
// 2] face values determined using the current face interpolation scheme
//    for the field (linear, gamma, etc.)
interpolationScheme cell;
type sets;
libs ("libsampling.so");
// Fields to sample.
fields
(
    U
    UData
);


// Set sampling definition: choice of
//      uniform             evenly distributed points on line
//      face                one point per face intersection
//      midPoint            one point per cell, in between two face intersections
//      midPointAndFace     combination of face and midPoint
//
//      curve               specified points, not necessary on line, uses
//                          tracking
//      cloud               specified points, uses findCell
//
// axis: how to write point coordinate. Choice of
// - x/y/z: x/y/z coordinate only
// - xyz: three columns
//  (probably does not make sense for anything but raw)
// - distance: distance from start of sampling line (if uses line) or
//             distance from first specified sampling point
//
// type specific:
//      uniform, face, midPoint, midPointAndFace : start and end coordinate
//      uniform: extra number of sampling points
//      curve, cloud: list of coordinates
sets
(
    Centerline
    {
        type        midPoint;
        axis        distance;

        start       (0.5 -1 0.05);
        end         (0.5 4 0.05);
        //nPoints     500;
    }
     Centerline1
    {
        type        midPoint;
        axis        distance;

        start       (2 -1 0.05);
        end         (2 4 0.05);
        //nPoints     500;
    }
     Centerline2
    {
        type        midPoint;
        axis        distance;

        start       (3 -1 0.05);
        end         (3 4 0.05);
        //nPoints     500;
    }
     Centerline3
    {
        type        midPoint;
        axis        distance;

        start       (4 -1 0.05);
        end         (4 4 0.05);
        //nPoints     500;
    }
     Centerline4
    {
        type        midPoint;
        axis        distance;

        start       (5 -1 0.05);
        end         (5 4 0.05);
        //nPoints     500;
    }
         Centerline5
    {
        type        midPoint;
        axis        distance;

        start       (6 -1 0.05);
        end         (6 4 0.05);
        //nPoints     500;
    }
     Centerline6
    {
        type        midPoint;
        axis        distance;

        start       (7 -1 0.05);
        end         (7 4 0.05);
        //nPoints     500;
    }
     Centerline7
    {
        type        midPoint;
        axis        distance;

        start       (8 -1 0.05);
        end         (8 4 0.05);
        //nPoints     500;
    }
     Centerline8
    {
        type        midPoint;
        axis        distance;

        start       (8.5 -1 0.05);
        end         (8.5 4 0.05);
        //nPoints     500;
    }
   
);


// Surface sampling definition: choice of
//      plane : values on plane defined by point, normal.
//      patch : values on patch.
//
// 1] patches are not triangulated by default
// 2] planes are always triangulated
// 3] iso-surfaces are always triangulated
surfaces ();

// *********************************************************************** //
